caiobrunholi/testmauaboards/MauaBoards_01/1.0.10/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM

mauaboards.name=MauaBoards

mauaboards.upload.tool=esptool_py
mauaboards.upload.maximum_size=1310720
mauaboards.upload.maximum_data_size=327680
mauaboards.upload.wait_for_upload_port=true

mauaboards.serial.disableDTR=true
mauaboards.serial.disableRTS=true

mauaboards.build.mcu=esp32
mauaboards.build.core=esp32
mauaboards.build.variant=esp32
mauaboards.build.board=ESP32_DEV

mauaboards.build.f_cpu=240000000L
mauaboards.build.flash_size=4MB
mauaboards.build.flash_freq=40m
mauaboards.build.flash_mode=dio
mauaboards.build.boot=dio
mauaboards.build.partitions=huge_app
mauaboards.build.defines=

mauaboards.menu.PSRAM.disabled=Disabled
mauaboards.menu.PSRAM.disabled.build.defines=
mauaboards.menu.PSRAM.disabled.build.extra_libs=
mauaboards.menu.PSRAM.enabled=Enabled
mauaboards.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
mauaboards.menu.PSRAM.enabled.build.extra_libs=-lc-psram-workaround -lm-psram-workaround

mauaboards.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
mauaboards.menu.PartitionScheme.default.build.partitions=default
mauaboards.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
mauaboards.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
mauaboards.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
mauaboards.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
mauaboards.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
mauaboards.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
mauaboards.menu.PartitionScheme.minimal.build.partitions=minimal
mauaboards.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
mauaboards.menu.PartitionScheme.no_ota.build.partitions=no_ota
mauaboards.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mauaboards.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
mauaboards.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
mauaboards.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
mauaboards.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
mauaboards.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
mauaboards.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
mauaboards.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
mauaboards.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
mauaboards.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
mauaboards.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
mauaboards.menu.PartitionScheme.huge_app.build.partitions=huge_app
mauaboards.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
mauaboards.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
mauaboards.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mauaboards.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
mauaboards.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
mauaboards.menu.PartitionScheme.fatflash.build.partitions=ffat
mauaboards.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
mauaboards.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
mauaboards.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
mauaboards.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

mauaboards.menu.CPUFreq.240=240MHz (WiFi/BT)
mauaboards.menu.CPUFreq.240.build.f_cpu=240000000L
mauaboards.menu.CPUFreq.160=160MHz (WiFi/BT)
mauaboards.menu.CPUFreq.160.build.f_cpu=160000000L
mauaboards.menu.CPUFreq.80=80MHz (WiFi/BT)
mauaboards.menu.CPUFreq.80.build.f_cpu=80000000L
mauaboards.menu.CPUFreq.40=40MHz (40MHz XTAL)
mauaboards.menu.CPUFreq.40.build.f_cpu=40000000L
mauaboards.menu.CPUFreq.26=26MHz (26MHz XTAL)
mauaboards.menu.CPUFreq.26.build.f_cpu=26000000L
mauaboards.menu.CPUFreq.20=20MHz (40MHz XTAL)
mauaboards.menu.CPUFreq.20.build.f_cpu=20000000L
mauaboards.menu.CPUFreq.13=13MHz (26MHz XTAL)
mauaboards.menu.CPUFreq.13.build.f_cpu=13000000L
mauaboards.menu.CPUFreq.10=10MHz (40MHz XTAL)
mauaboards.menu.CPUFreq.10.build.f_cpu=10000000L

mauaboards.menu.FlashMode.qio=QIO
mauaboards.menu.FlashMode.qio.build.flash_mode=dio
mauaboards.menu.FlashMode.qio.build.boot=qio
mauaboards.menu.FlashMode.dio=DIO
mauaboards.menu.FlashMode.dio.build.flash_mode=dio
mauaboards.menu.FlashMode.dio.build.boot=dio
mauaboards.menu.FlashMode.qout=QOUT
mauaboards.menu.FlashMode.qout.build.flash_mode=dout
mauaboards.menu.FlashMode.qout.build.boot=qout
mauaboards.menu.FlashMode.dout=DOUT
mauaboards.menu.FlashMode.dout.build.flash_mode=dout
mauaboards.menu.FlashMode.dout.build.boot=dout

mauaboards.menu.FlashFreq.80=80MHz
mauaboards.menu.FlashFreq.80.build.flash_freq=80m
mauaboards.menu.FlashFreq.40=40MHz
mauaboards.menu.FlashFreq.40.build.flash_freq=40m

mauaboards.menu.FlashSize.4M=4MB (32Mb)
mauaboards.menu.FlashSize.4M.build.flash_size=4MB
mauaboards.menu.FlashSize.8M=8MB (64Mb)
mauaboards.menu.FlashSize.8M.build.flash_size=8MB
mauaboards.menu.FlashSize.8M.build.partitions=default_8MB
mauaboards.menu.FlashSize.2M=2MB (16Mb)
mauaboards.menu.FlashSize.2M.build.flash_size=2MB
mauaboards.menu.FlashSize.2M.build.partitions=minimal
mauaboards.menu.FlashSize.16M=16MB (128Mb)
mauaboards.menu.FlashSize.16M.build.flash_size=16MB

mauaboards.menu.UploadSpeed.921600=921600
mauaboards.menu.UploadSpeed.921600.upload.speed=921600
mauaboards.menu.UploadSpeed.115200=115200
mauaboards.menu.UploadSpeed.115200.upload.speed=115200
mauaboards.menu.UploadSpeed.256000.windows=256000
mauaboards.menu.UploadSpeed.256000.upload.speed=256000
mauaboards.menu.UploadSpeed.230400.windows.upload.speed=256000
mauaboards.menu.UploadSpeed.230400=230400
mauaboards.menu.UploadSpeed.230400.upload.speed=230400
mauaboards.menu.UploadSpeed.460800.linux=460800
mauaboards.menu.UploadSpeed.460800.macosx=460800
mauaboards.menu.UploadSpeed.460800.upload.speed=460800
mauaboards.menu.UploadSpeed.512000.windows=512000
mauaboards.menu.UploadSpeed.512000.upload.speed=512000

mauaboards.menu.DebugLevel.none=None
mauaboards.menu.DebugLevel.none.build.code_debug=0
mauaboards.menu.DebugLevel.error=Error
mauaboards.menu.DebugLevel.error.build.code_debug=1
mauaboards.menu.DebugLevel.warn=Warn
mauaboards.menu.DebugLevel.warn.build.code_debug=2
mauaboards.menu.DebugLevel.info=Info
mauaboards.menu.DebugLevel.info.build.code_debug=3
mauaboards.menu.DebugLevel.debug=Debug
mauaboards.menu.DebugLevel.debug.build.code_debug=4
mauaboards.menu.DebugLevel.verbose=Verbose
mauaboards.menu.DebugLevel.verbose.build.code_debug=5


